turbq/atprog/packs/atmel/SAM3U_DFP/1.0.49/atdf/ATSAM3U4C.atdf
<?xml version="1.0" encoding="UTF-8"?>
<!-- ============================================================================ -->
<!--                  Atmel Microcontroller Software Support                      -->
<!--                       SAM Software Package License                           -->
<!-- ============================================================================ -->
<!-- Copyright (c) %copyright_year%, Atmel Corporation                                        -->
<!--                                                                              -->
<!-- All rights reserved.                                                         -->
<!--                                                                              -->
<!-- Redistribution and use in source and binary forms, with or without           -->
<!-- modification, are permitted provided that the following condition is met:    -->
<!--                                                                              -->
<!-- - Redistributions of source code must retain the above copyright notice,     -->
<!-- this list of conditions and the disclaimer below.                            -->
<!--                                                                              -->
<!-- Atmel's name may not be used to endorse or promote products derived from     -->
<!-- this software without specific prior written permission.                     -->
<!--                                                                              -->
<!-- DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR   -->
<!-- IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF -->
<!-- MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE   -->
<!-- DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,      -->
<!-- INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT -->
<!-- LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,  -->
<!-- OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF    -->
<!-- LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING         -->
<!-- NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, -->
<!-- EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                           -->
<!-- ============================================================================ -->
<avr-tools-device-file xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="0.6" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
  <variants>
    <variant ordercode="ATSAM3U4C-CU" package="BGA100" speedmax="96000000" tempmax="85" tempmin="-40" vccmax="3.6" vccmin="1.62"/>
    <variant ordercode="ATSAM3U4C-AU" package="LQFP100" speedmax="96000000" tempmax="85" tempmin="-40" vccmax="3.6" vccmin="1.62"/>
  </variants>
  <devices>
    <device architecture="CORTEX-M3" family="SAM3" name="ATSAM3U4C" series="SAM3U">
      <address-spaces>
        <address-space id="base" name="base" endianness="little" size="0x100000000" start="0">
          <memory-segment name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io"/>
          <memory-segment name="SYSTEM" start="0xE0000000" size="0x10000000" type="io"/>
          <memory-segment name="IFLASH0" start="0x00080000" size="0x00020000" type="flash" pagesize="256" mirror-mask="0x60000"/>
          <memory-segment name="IFLASH1" start="0x00100000" size="0x00020000" type="flash" pagesize="256" mirror-mask="0x60000"/>
          <memory-segment name="IROM" start="0x00180000" size="0x00100000" type="rom"/>
          <memory-segment name="IRAM0" start="0x20000000" size="0x00008000" type="ram" mirror-mask="0x78000"/>
          <memory-segment name="IRAM1" start="0x20080000" size="0x00004000" type="ram" mirror-mask="0x7C000"/>
          <memory-segment name="NFC_RAM" start="0x20100000" size="0x00100000" type="other"/>
          <memory-segment name="UDPHS_RAM" start="0x20180000" size="0x00100000" type="other"/>
        <memory-segment name="EBI_CS0" start="0x60000000" size="0x01000000" type="other"/><memory-segment name="EBI_CS1" start="0x61000000" size="0x01000000" type="other"/><memory-segment name="EBI_CS2" start="0x62000000" size="0x01000000" type="other"/><memory-segment name="EBI_CS3" start="0x63000000" size="0x01000000" type="other"/></address-space>
        <address-space id="fuses" name="fuses" endianness="little" size="4" start="0"/>
        <address-space id="lockbits" name="lockbits" endianness="little" size="4" start="0"/>
      </address-spaces>
      <peripherals>
        <module name="ADC" version="6051K">
          <instance name="ADC">
            <register-group address-space="base" name="ADC" name-in-module="ADC" offset="0x400AC000"/>
            <signals>
              <signal pad="PA17" function="B" group="ADTRG"/>
              <signal pad="PB5" function="X1" group="AD" index="0"/>
              <signal pad="PB6" function="X1" group="AD" index="1"/>
              <signal pad="PB7" function="X1" group="AD" index="2"/>
              <signal pad="PB8" function="X1" group="AD" index="3"/>
              <signal pad="PC28" function="X1" group="AD" index="4"/>
              <signal pad="PC29" function="X1" group="AD" index="5"/>
              <signal pad="PC30" function="X1" group="AD" index="6"/>
              <signal pad="PC31" function="X1" group="AD" index="7"/>
            </signals>
          </instance>
        </module>
        <module name="ADC12B" version="6448C">
          <instance name="ADC12B">
            <register-group address-space="base" name="ADC12B" name-in-module="ADC12B" offset="0x400A8000"/>
            <signals>
              <signal pad="PA2" function="B" group="AD12BTRG"/>
              <signal pad="PA22" function="X1" group="AD12B" index="0"/>
              <signal pad="PA30" function="X1" group="AD12B" index="1"/>
              <signal pad="PB3" function="X1" group="AD12B" index="2"/>
              <signal pad="PB4" function="X1" group="AD12B" index="3"/>
              <signal pad="PC15" function="X1" group="AD12B" index="4"/>
              <signal pad="PC16" function="X1" group="AD12B" index="5"/>
              <signal pad="PC17" function="X1" group="AD12B" index="6"/>
              <signal pad="PC18" function="X1" group="AD12B" index="7"/>
            </signals>
          </instance>
        </module>
        <module name="CHIPID" version="6417P">
          <instance name="CHIPID">
            <register-group address-space="base" name="CHIPID" name-in-module="CHIPID" offset="0x400E0740"/>
