turbq/atprog/packs/atmel/SAM3U_DFP/1.0.49/atdf/ATSAM3U4C.atdf
          </instance>
        </module>
        <module name="DMAC" version="6233P">
          <instance name="DMAC">
            <register-group address-space="base" name="DMAC" name-in-module="DMAC" offset="0x400B0000"/>
          </instance>
        </module>
        <module name="EFC" version="6450J">
          <instance name="EFC0">
            <register-group address-space="base" name="EFC0" name-in-module="EFC" offset="0x400E0800"/>
            <parameters>
              <param name="FLASH_SIZE" value="131072"/>
              <param name="PAGE_SIZE" value="256"/>
              <param name="PAGES_PR_REGION" value="32"/>
            </parameters>
          </instance>
          <instance name="EFC1">
            <register-group address-space="base" name="EFC1" name-in-module="EFC" offset="0x400E0A00"/>
            <parameters>
              <param name="FLASH_SIZE" value="131072"/>
              <param name="PAGE_SIZE" value="256"/>
              <param name="PAGES_PR_REGION" value="32"/>
            </parameters>
          </instance>
        </module>
        <module name="GPBR" version="6378C">
          <instance name="GPBR">
            <register-group address-space="base" name="GPBR" name-in-module="GPBR" offset="0x400E1290"/>
          </instance>
        </module>
        <module name="HSMCI" version="6449L">
          <instance name="HSMCI">
            <register-group address-space="base" name="HSMCI" name-in-module="HSMCI" offset="0x40000000"/>
            <signals>
              <signal pad="PA4" function="A" group="MCCDA"/>
              <signal pad="PA3" function="A" group="MCCK"/>
              <signal pad="PA5" function="A" group="MCDA" index="0"/>
              <signal pad="PA6" function="A" group="MCDA" index="1"/>
              <signal pad="PA7" function="A" group="MCDA" index="2"/>
              <signal pad="PA8" function="A" group="MCDA" index="3"/>
              <signal pad="PC28" function="B" group="MCDA" index="4"/>
              <signal pad="PC29" function="B" group="MCDA" index="5"/>
              <signal pad="PC30" function="B" group="MCDA" index="6"/>
              <signal pad="PC31" function="B" group="MCDA" index="7"/>
            </signals>
          </instance>
        </module>
        <module name="MATRIX" version="6469A">
          <instance name="MATRIX">
            <register-group address-space="base" name="MATRIX" name-in-module="MATRIX" offset="0x400E0200"/>
          </instance>
        </module>
        <module name="PIO" version="6315C">
          <instance name="PIOA">
            <register-group address-space="base" name="PIOA" name-in-module="PIO" offset="0x400E0C00"/>
          </instance>
          <instance name="PIOB">
            <register-group address-space="base" name="PIOB" name-in-module="PIO" offset="0x400E0E00"/>
          </instance>
        </module>
        <module name="PMC" version="11116I">
          <instance name="PMC">
            <register-group address-space="base" name="PMC" name-in-module="PMC" offset="0x400E0400"/>
            <signals>
              <signal pad="PA21" function="B" group="PCK" index="0"/>
              <signal pad="PA27" function="B" group="PCK" index="0"/>
              <signal pad="PA3" function="B" group="PCK" index="1"/>
              <signal pad="PB24" function="B" group="PCK" index="1"/>
              <signal pad="PB23" function="B" group="PCK" index="2"/>
            </signals>
          </instance>
        </module>
        <module name="PWM" version="6343J">
          <instance name="PWM">
            <register-group address-space="base" name="PWM" name-in-module="PWM" offset="0x4008C000"/>
            <signals>
              <signal pad="PA11" function="B" group="PWMFI" index="0"/>
              <signal pad="PA12" function="B" group="PWMFI" index="1"/>
              <signal pad="PA18" function="B" group="PWMFI" index="2"/>
              <signal pad="PA4" function="B" group="PWMH" index="0"/>
              <signal pad="PA28" function="B" group="PWMH" index="0"/>
              <signal pad="PB0" function="A" group="PWMH" index="0"/>
              <signal pad="PB13" function="B" group="PWMH" index="0"/>
              <signal pad="PC24" function="B" group="PWMH" index="0"/>
              <signal pad="PA5" function="B" group="PWMH" index="1"/>
              <signal pad="PA29" function="B" group="PWMH" index="1"/>
              <signal pad="PB1" function="A" group="PWMH" index="1"/>
              <signal pad="PB14" function="B" group="PWMH" index="1"/>
              <signal pad="PC25" function="B" group="PWMH" index="1"/>
              <signal pad="PA6" function="B" group="PWMH" index="2"/>
              <signal pad="PA15" function="B" group="PWMH" index="2"/>
              <signal pad="PB2" function="A" group="PWMH" index="2"/>
              <signal pad="PB15" function="B" group="PWMH" index="2"/>
              <signal pad="PC26" function="B" group="PWMH" index="2"/>
              <signal pad="PA20" function="B" group="PWMH" index="3"/>
              <signal pad="PB3" function="A" group="PWMH" index="3"/>
              <signal pad="PB16" function="B" group="PWMH" index="3"/>
              <signal pad="PC27" function="B" group="PWMH" index="3"/>
              <signal pad="PA7" function="B" group="PWML" index="0"/>
              <signal pad="PB17" function="B" group="PWML" index="0"/>
              <signal pad="PB25" function="B" group="PWML" index="0"/>
              <signal pad="PC6" function="B" group="PWML" index="0"/>
              <signal pad="PC29" function="A" group="PWML" index="0"/>
              <signal pad="PA8" function="B" group="PWML" index="1"/>
              <signal pad="PB18" function="B" group="PWML" index="1"/>
              <signal pad="PB26" function="B" group="PWML" index="1"/>
              <signal pad="PC7" function="B" group="PWML" index="1"/>
              <signal pad="PC30" function="A" group="PWML" index="1"/>
              <signal pad="PA9" function="B" group="PWML" index="2"/>
              <signal pad="PB19" function="B" group="PWML" index="2"/>
              <signal pad="PB27" function="B" group="PWML" index="2"/>
              <signal pad="PC8" function="B" group="PWML" index="2"/>
              <signal pad="PC31" function="A" group="PWML" index="2"/>
              <signal pad="PA10" function="B" group="PWML" index="3"/>
              <signal pad="PB20" function="B" group="PWML" index="3"/>
              <signal pad="PB28" function="B" group="PWML" index="3"/>
              <signal pad="PC9" function="B" group="PWML" index="3"/>
              <signal pad="PC16" function="B" group="PWML" index="3"/>
            </signals>
          </instance>
        </module>
        <module name="RSTC" version="6373A">
          <instance name="RSTC">
            <register-group address-space="base" name="RSTC" name-in-module="RSTC" offset="0x400E1200"/>
