turbq/atprog/packs/atmel/SAM3U_DFP/1.0.49/atdf/ATSAM3U4C.atdf
        <register caption="Interrupt Mask Register" name="UART_IMR" offset="0x0010" rw="R" size="4">
          <bitfield caption="Mask RXRDY Interrupt" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="Disable TXRDY Interrupt" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Mask End of Receive Transfer Interrupt" mask="0x00000008" name="ENDRX"/>
          <bitfield caption="Mask End of Transmit Interrupt" mask="0x00000010" name="ENDTX"/>
          <bitfield caption="Mask Overrun Error Interrupt" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Mask Framing Error Interrupt" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Mask Parity Error Interrupt" mask="0x00000080" name="PARE"/>
          <bitfield caption="Mask TXEMPTY Interrupt" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Mask TXBUFE Interrupt" mask="0x00000800" name="TXBUFE"/>
          <bitfield caption="Mask RXBUFF Interrupt" mask="0x00001000" name="RXBUFF"/>
        </register>
        <register caption="Status Register" name="UART_SR" offset="0x0014" rw="R" size="4">
          <bitfield caption="Receiver Ready" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="Transmitter Ready" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="End of Receiver Transfer" mask="0x00000008" name="ENDRX"/>
          <bitfield caption="End of Transmitter Transfer" mask="0x00000010" name="ENDTX"/>
          <bitfield caption="Overrun Error" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Framing Error" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Parity Error" mask="0x00000080" name="PARE"/>
          <bitfield caption="Transmitter Empty" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Transmission Buffer Empty" mask="0x00000800" name="TXBUFE"/>
          <bitfield caption="Receive Buffer Full" mask="0x00001000" name="RXBUFF"/>
        </register>
        <register caption="Receive Holding Register" name="UART_RHR" offset="0x0018" rw="R" size="4">
          <bitfield caption="Received Character" mask="0x000000FF" name="RXCHR"/>
        </register>
        <register caption="Transmit Holding Register" name="UART_THR" offset="0x001C" rw="W" size="4">
          <bitfield caption="Character to be Transmitted" mask="0x000000FF" name="TXCHR"/>
        </register>
        <register caption="Baud Rate Generator Register" name="UART_BRGR" offset="0x0020" rw="RW" size="4">
          <bitfield caption="Clock Divisor" mask="0x0000FFFF" name="CD"/>
        </register>
        <register caption="Receive Pointer Register" name="UART_RPR" offset="0x100" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Counter Register" name="UART_RCR" offset="0x104" rw="RW" size="4">
          <bitfield caption="Receive Counter Register" mask="0x0000FFFF" name="RXCTR"/>
        </register>
        <register caption="Transmit Pointer Register" name="UART_TPR" offset="0x108" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0xFFFFFFFF" name="TXPTR"/>
        </register>
        <register caption="Transmit Counter Register" name="UART_TCR" offset="0x10C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0x0000FFFF" name="TXCTR"/>
        </register>
        <register caption="Receive Next Pointer Register" name="UART_RNPR" offset="0x110" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register" name="UART_RNCR" offset="0x114" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transmit Next Pointer Register" name="UART_TNPR" offset="0x118" rw="RW" size="4">
          <bitfield caption="Transmit Next Pointer" mask="0xFFFFFFFF" name="TXNPTR"/>
        </register>
        <register caption="Transmit Next Counter Register" name="UART_TNCR" offset="0x11C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Next" mask="0x0000FFFF" name="TXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="UART_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
        </register>
        <register caption="Transfer Status Register" name="UART_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
        </register>
      </register-group>
      <value-group caption="" name="UART_MR__PAR">
        <value caption="Even Parity" name="EVEN" value="0x0"/>
        <value caption="Odd Parity" name="ODD" value="0x1"/>
        <value caption="Space: parity forced to 0" name="SPACE" value="0x2"/>
        <value caption="Mark: parity forced to 1" name="MARK" value="0x3"/>
        <value caption="No Parity" name="NO" value="0x4"/>
      </value-group>
      <value-group caption="" name="UART_MR__CHMODE">
        <value caption="Normal Mode" name="NORMAL" value="0x0"/>
        <value caption="Automatic Echo" name="AUTOMATIC" value="0x1"/>
        <value caption="Local Loopback" name="LOCAL_LOOPBACK" value="0x2"/>
        <value caption="Remote Loopback" name="REMOTE_LOOPBACK" value="0x3"/>
      </value-group>
    </module>
    <module caption="USB High Speed Device Port" name="UDPHS" version="6227O">
      <register-group name="UDPHS">
        <register caption="UDPHS Control Register" name="UDPHS_CTRL" offset="0x00" rw="RW" size="4">
          <bitfield caption="UDPHS Address" mask="0x0000007F" name="DEV_ADDR"/>
          <bitfield caption="Function Address Enable" mask="0x00000080" name="FADDR_EN"/>
          <bitfield caption="UDPHS Enable" mask="0x00000100" name="EN_UDPHS"/>
          <bitfield caption="Detach Command" mask="0x00000200" name="DETACH"/>
          <bitfield caption="Send Remote Wake Up" mask="0x00000400" name="REWAKEUP"/>
          <bitfield caption="Pull-Down Disable" mask="0x00000800" name="PULLD_DIS"/>
        </register>
        <register caption="UDPHS Frame Number Register" name="UDPHS_FNUM" offset="0x04" rw="R" size="4">
          <bitfield caption="Microframe Number" mask="0x00000007" name="MICRO_FRAME_NUM"/>
          <bitfield caption="Frame Number as defined in the Packet Field Formats" mask="0x00003FF8" name="FRAME_NUMBER"/>
          <bitfield caption="Frame Number CRC Error" mask="0x80000000" name="FNUM_ERR"/>
        </register>
