turbq/atprog/packs/atmel/SAM3U_DFP/1.0.49/atdf/ATSAM3U4C.atdf
        <register caption="UDPHS Endpoint Set Status Register (endpoint = 1)" name="UDPHS_EPTSETSTA1" offset="0x134" rw="W" size="4">
          <bitfield caption="Stall Handshake Request Set" mask="0x00000020" name="FRCESTALL"/>
          <bitfield caption="KILL Bank Set (for IN Endpoint)" mask="0x00000200" name="RXRDY_TXKL"/>
          <bitfield caption="TX Packet Ready Set" mask="0x00000800" name="TXRDY"/>
        </register>
        <register caption="UDPHS Endpoint Clear Status Register (endpoint = 1)" name="UDPHS_EPTCLRSTA1" offset="0x138" rw="W" size="4">
          <bitfield caption="Stall Handshake Request Clear" mask="0x00000020" name="FRCESTALL"/>
          <bitfield caption="Data Toggle Clear" mask="0x00000040" name="TOGGLESQ"/>
          <bitfield caption="Received OUT Data Clear" mask="0x00000200" name="RXRDY_TXKL"/>
          <bitfield caption="Transmitted IN Data Complete Clear" mask="0x00000400" name="TX_COMPLT"/>
          <bitfield caption="Received SETUP Clear" mask="0x00001000" name="RX_SETUP"/>
          <bitfield caption="Stall Sent Clear" mask="0x00002000" name="STALL_SNT"/>
          <bitfield caption="NAKIN Clear" mask="0x00004000" name="NAK_IN"/>
          <bitfield caption="NAKOUT Clear" mask="0x00008000" name="NAK_OUT"/>
        </register>
        <register caption="UDPHS Endpoint Status Register (endpoint = 1)" name="UDPHS_EPTSTA1" offset="0x13C" rw="R" size="4">
          <bitfield caption="Stall Handshake Request" mask="0x00000020" name="FRCESTALL"/>
          <bitfield caption="Toggle Sequencing" mask="0x000000C0" name="TOGGLESQ_STA" values="UDPHS_EPTSTA1__TOGGLESQ_STA"/>
          <bitfield caption="Overflow Error" mask="0x00000100" name="ERR_OVFLW"/>
          <bitfield caption="Received OUT Data/KILL Bank" mask="0x00000200" name="RXRDY_TXKL"/>
          <bitfield caption="Transmitted IN Data Complete" mask="0x00000400" name="TX_COMPLT"/>
          <bitfield caption="TX Packet Ready" mask="0x00000800" name="TXRDY"/>
          <bitfield caption="Received SETUP" mask="0x00001000" name="RX_SETUP"/>
          <bitfield caption="Stall Sent" mask="0x00002000" name="STALL_SNT"/>
          <bitfield caption="NAK IN" mask="0x00004000" name="NAK_IN"/>
          <bitfield caption="NAK OUT" mask="0x00008000" name="NAK_OUT"/>
          <bitfield caption="Current Bank/Control Direction" mask="0x00030000" name="CURBK_CTLDIR"/>
          <bitfield caption="Busy Bank Number" mask="0x000C0000" name="BUSY_BANK_STA" values="UDPHS_EPTSTA1__BUSY_BANK_STA"/>
          <bitfield caption="UDPHS Byte Count" mask="0x7FF00000" name="BYTE_COUNT"/>
          <bitfield caption="Short Packet" mask="0x80000000" name="SHRT_PCKT"/>
        </register>
        <register caption="UDPHS Endpoint Configuration Register (endpoint = 2)" name="UDPHS_EPTCFG2" offset="0x140" rw="RW" size="4">
          <bitfield caption="Endpoint Size" mask="0x00000007" name="EPT_SIZE" values="UDPHS_EPTCFG2__EPT_SIZE"/>
          <bitfield caption="Endpoint Direction" mask="0x00000008" name="EPT_DIR"/>
          <bitfield caption="Endpoint Type" mask="0x00000030" name="EPT_TYPE" values="UDPHS_EPTCFG2__EPT_TYPE"/>
          <bitfield caption="Number of Banks" mask="0x000000C0" name="BK_NUMBER" values="UDPHS_EPTCFG2__BK_NUMBER"/>
          <bitfield caption="Number Of Transaction per Microframe" mask="0x00000300" name="NB_TRANS"/>
          <bitfield caption="Endpoint Mapped" mask="0x80000000" name="EPT_MAPD"/>
        </register>
        <register caption="UDPHS Endpoint Control Enable Register (endpoint = 2)" name="UDPHS_EPTCTLENB2" offset="0x144" rw="W" size="4">
          <bitfield caption="Endpoint Enable" mask="0x00000001" name="EPT_ENABL"/>
          <bitfield caption="Packet Auto-Valid Enable" mask="0x00000002" name="AUTO_VALID"/>
          <bitfield caption="Interrupts Disable DMA" mask="0x00000008" name="INTDIS_DMA"/>
          <bitfield caption="NYET Disable (Only for High Speed Bulk OUT endpoints)" mask="0x00000010" name="NYET_DIS"/>
          <bitfield caption="Overflow Error Interrupt Enable" mask="0x00000100" name="ERR_OVFLW"/>
          <bitfield caption="Received OUT Data Interrupt Enable" mask="0x00000200" name="RXRDY_TXKL"/>
          <bitfield caption="Transmitted IN Data Complete Interrupt Enable" mask="0x00000400" name="TX_COMPLT"/>
          <bitfield caption="TX Packet Ready Interrupt Enable" mask="0x00000800" name="TXRDY"/>
          <bitfield caption="Received SETUP" mask="0x00001000" name="RX_SETUP"/>
          <bitfield caption="Stall Sent Interrupt Enable" mask="0x00002000" name="STALL_SNT"/>
          <bitfield caption="NAKIN Interrupt Enable" mask="0x00004000" name="NAK_IN"/>
          <bitfield caption="NAKOUT Interrupt Enable" mask="0x00008000" name="NAK_OUT"/>
          <bitfield caption="Busy Bank Interrupt Enable" mask="0x00040000" name="BUSY_BANK"/>
          <bitfield caption="Short Packet Send/Short Packet Interrupt Enable" mask="0x80000000" name="SHRT_PCKT"/>
        </register>
        <register caption="UDPHS Endpoint Control Disable Register (endpoint = 2)" name="UDPHS_EPTCTLDIS2" offset="0x148" rw="W" size="4">
          <bitfield caption="Endpoint Disable" mask="0x00000001" name="EPT_DISABL"/>
          <bitfield caption="Packet Auto-Valid Disable" mask="0x00000002" name="AUTO_VALID"/>
          <bitfield caption="Interrupts Disable DMA" mask="0x00000008" name="INTDIS_DMA"/>
          <bitfield caption="NYET Enable (Only for High Speed Bulk OUT endpoints)" mask="0x00000010" name="NYET_DIS"/>
          <bitfield caption="Overflow Error Interrupt Disable" mask="0x00000100" name="ERR_OVFLW"/>
          <bitfield caption="Received OUT Data Interrupt Disable" mask="0x00000200" name="RXRDY_TXKL"/>
          <bitfield caption="Transmitted IN Data Complete Interrupt Disable" mask="0x00000400" name="TX_COMPLT"/>
          <bitfield caption="TX Packet Ready Interrupt Disable" mask="0x00000800" name="TXRDY"/>
          <bitfield caption="Received SETUP Interrupt Disable" mask="0x00001000" name="RX_SETUP"/>
          <bitfield caption="Stall Sent Interrupt Disable" mask="0x00002000" name="STALL_SNT"/>
          <bitfield caption="NAKIN Interrupt Disable" mask="0x00004000" name="NAK_IN"/>
          <bitfield caption="NAKOUT Interrupt Disable" mask="0x00008000" name="NAK_OUT"/>
          <bitfield caption="Busy Bank Interrupt Disable" mask="0x00040000" name="BUSY_BANK"/>
          <bitfield caption="Short Packet Interrupt Disable" mask="0x80000000" name="SHRT_PCKT"/>
        </register>
        <register caption="UDPHS Endpoint Control Register (endpoint = 2)" name="UDPHS_EPTCTL2" offset="0x14C" rw="R" size="4">
          <bitfield caption="Endpoint Enable" mask="0x00000001" name="EPT_ENABL"/>
          <bitfield caption="Packet Auto-Valid Enabled (Not for CONTROL Endpoints)" mask="0x00000002" name="AUTO_VALID"/>
          <bitfield caption="Interrupt Disables DMA" mask="0x00000008" name="INTDIS_DMA"/>
          <bitfield caption="NYET Disable (Only for High Speed Bulk OUT endpoints)" mask="0x00000010" name="NYET_DIS"/>
          <bitfield caption="Overflow Error Interrupt Enabled" mask="0x00000100" name="ERR_OVFLW"/>
          <bitfield caption="Received OUT Data Interrupt Enabled" mask="0x00000200" name="RXRDY_TXKL"/>
          <bitfield caption="Transmitted IN Data Complete Interrupt Enabled" mask="0x00000400" name="TX_COMPLT"/>
          <bitfield caption="TX Packet Ready Interrupt Enabled" mask="0x00000800" name="TXRDY"/>
          <bitfield caption="Received SETUP Interrupt Enabled" mask="0x00001000" name="RX_SETUP"/>
          <bitfield caption="Stall Sent Interrupt Enabled" mask="0x00002000" name="STALL_SNT"/>
          <bitfield caption="NAKIN Interrupt Enabled" mask="0x00004000" name="NAK_IN"/>
          <bitfield caption="NAKOUT Interrupt Enabled" mask="0x00008000" name="NAK_OUT"/>
          <bitfield caption="Busy Bank Interrupt Enabled" mask="0x00040000" name="BUSY_BANK"/>
          <bitfield caption="Short Packet Interrupt Enabled" mask="0x80000000" name="SHRT_PCKT"/>
        </register>
