turbq/atprog/packs/atmel/SAM3U_DFP/1.0.49/atdf/ATSAM3U4C.atdf
            <value-group name="USGFAULTENA">
                <value value="0" name="VALUE_0" caption="disable the exception"/>
                <value value="1" name="VALUE_1" caption="enable the exception"/>
            </value-group>
            <value-group name="IACCVIOL">
                <value value="0" name="VALUE_0" caption="no instruction access violation fault"/>
                <value value="1" name="VALUE_1" caption="the processor attempted an instruction fetch from a location that does not permit execution"/>
            </value-group>
            <value-group name="DACCVIOL">
                <value value="0" name="VALUE_0" caption="no data access violation fault"/>
                <value value="1" name="VALUE_1" caption="the processor attempted a load or store at a location that does not permit the operation"/>
            </value-group>
            <value-group name="MUNSTKERR">
                <value value="0" name="VALUE_0" caption="no unstacking fault"/>
                <value value="1" name="VALUE_1" caption="unstack for an exception return has caused one or more access violations"/>
            </value-group>
            <value-group name="MSTKERR">
                <value value="0" name="VALUE_0" caption="no stacking fault"/>
                <value value="1" name="VALUE_1" caption="stacking for an exception entry has caused one or more access violations"/>
            </value-group>
            <value-group name="MLSPERR">
                <value value="0" name="VALUE_0" caption="No MemManage fault occurred during floating-point lazy state preservation"/>
                <value value="1" name="VALUE_1" caption="A MemManage fault occurred during floating-point lazy state preservation"/>
            </value-group>
            <value-group name="MMARVALID">
                <value value="0" name="VALUE_0" caption="value in MMAR is not a valid fault address"/>
                <value value="1" name="VALUE_1" caption="MMAR holds a valid fault address"/>
            </value-group>
            <value-group name="IBUSERR">
                <value value="0" name="VALUE_0" caption="no instruction bus error"/>
                <value value="1" name="VALUE_1" caption="instruction bus error"/>
            </value-group>
            <value-group name="PRECISERR">
                <value value="0" name="VALUE_0" caption="no precise data bus error"/>
                <value value="1" name="VALUE_1" caption="a data bus error has occurred, and the PC value stacked for the exception return points to the instruction that caused the fault"/>
            </value-group>
            <value-group name="IMPRECISERR">
                <value value="0" name="VALUE_0" caption="no imprecise data bus error"/>
                <value value="1" name="VALUE_1" caption="a data bus error has occurred, but the return address in the stack frame is not related to the instruction that caused the error"/>
            </value-group>
            <value-group name="UNSTKERR">
                <value value="0" name="VALUE_0" caption="no unstacking fault"/>
                <value value="1" name="VALUE_1" caption="unstack for an exception return has caused one or more BusFaults"/>
            </value-group>
            <value-group name="STKERR">
                <value value="0" name="VALUE_0" caption="no stacking fault"/>
                <value value="1" name="VALUE_1" caption="stacking for an exception entry has caused one or more BusFaults"/>
            </value-group>
            <value-group name="LSPERR">
                <value value="0" name="VALUE_0" caption="No bus fault occurred during floating-point lazy state preservation"/>
                <value value="1" name="VALUE_1" caption="A bus fault occurred during floating-point lazy state preservation"/>
            </value-group>
            <value-group name="BFARVALID">
                <value value="0" name="VALUE_0" caption="value in BFAR is not a valid fault address"/>
                <value value="1" name="VALUE_1" caption="BFAR holds a valid fault address"/>
            </value-group>
            <value-group name="UNDEFINSTR">
                <value value="0" name="VALUE_0" caption="no undefined instruction UsageFault"/>
                <value value="1" name="VALUE_1" caption="the processor has attempted to execute an undefined instruction"/>
            </value-group>
            <value-group name="INVSTATE">
                <value value="0" name="VALUE_0" caption="no invalid state UsageFault"/>
                <value value="1" name="VALUE_1" caption="the processor has attempted to execute an instruction that makes illegal use of the EPSR"/>
            </value-group>
            <value-group name="INVPC">
                <value value="0" name="VALUE_0" caption="no invalid PC load UsageFault"/>
                <value value="1" name="VALUE_1" caption="the processor has attempted an illegal load of EXC_RETURN to the PC"/>
            </value-group>
            <value-group name="NOCP">
                <value value="0" name="VALUE_0" caption="no UsageFault caused by attempting to access a coprocessor"/>
                <value value="1" name="VALUE_1" caption="the processor has attempted to access a coprocessor"/>
            </value-group>
            <value-group name="UNALIGNED">
                <value value="0" name="VALUE_0" caption="no unaligned access fault, or unaligned access trapping not enabled"/>
                <value value="1" name="VALUE_1" caption="the processor has made an unaligned memory access"/>
            </value-group>
            <value-group name="DIVBYZERO">
                <value value="0" name="VALUE_0" caption="no divide by zero fault, or divide by zero trapping not enabled"/>
                <value value="1" name="VALUE_1" caption="the processor has executed an SDIV or UDIV instruction with a divisor of 0"/>
            </value-group>
            <value-group name="VECTTBL">
                <value value="0" name="VALUE_0" caption="no BusFault on vector table read"/>
                <value value="1" name="VALUE_1" caption="BusFault on vector table read"/>
            </value-group>
